# ImportSymbolBaseLevelInvalid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ImportSymbolBaseLevelInvalid Property
BuiltInFailures..::..ImportFailures Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ImportSymbolBaseLevelInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportSymbolBaseLevelInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ImportSymbolBaseLevelInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace